<#--  Описание команд и их сообщения  -->
commands-makecontestpost-description = Создать сообщение о конкурсе
commands-makecontestpost-post-failed = Не удалось создать сообщение с публикацией
commands-makecontestpost-post-created = Публикация успешно создана: [Публикация]({ $url })
commands-makecontestpost-post-message =
    # :tada: RuNukkit исполняется 2 года!

    Завтра мы отмечаем важную дату – нашему сообществу RuNukkit исполняется **2 года**! В честь этого события мы запускаем **конкурс**, в котором вы сможете проявить себя и выиграть крутые призы! :bulb:

    ## :trophy: Подробности конкурса

    Конкурс продлится с **15 декабря** до **31 декабря**. Ваша задача — создать плагин для ядра Nukkit или одного из его форков и опубликовать его в канале **<#1316514252978126919>**.

    ### Критерии оценки:
    - :bulb: **Идея** — насколько ваш плагин оригинален и интересен.
    - :gear: **Функционал** — насколько ваш плагин увлекателен, проработан и насколько разнообразны его функции.
    - :broom: **Качество кода** — чистота и аккуратность реализации.

    Победителей выберем **мы** вместе с помощью голосования от участников сообщества. :rocket:

    ## :gift: Призы

    Для победителей предусмотрено **5 призовых мест**:

    1. :first_place: **Хостинг с 8GB RAM** под любые задачи на 1 месяц.
    2. :second_place: **Хостинг с 6GB RAM** под любые задачи на 1 месяц.
    3. :third_place: **Хостинг с 4GB RAM** под любые задачи на 1 месяц.
    4. **Discord Nitro Full** или **Telegram Premium** на 1 месяц.
    5. **Discord Nitro Basic** или **Telegram Premium** на 1 месяц.

    ## Как участвовать?

    1. Создайте уникальный плагин для Nukkit или его форков.
    2. Разместите его в канале **<#1316514252978126919>** до 31 декабря.
    3. Ждите результатов, которые будут объявлены в начале нового года. :sparkler:

    Присоединяйтесь к нашему празднику, проявите своё мастерство и боритесь за крутые награды! Удачи всем участникам! :sparkles:

commands-makepluginpost-description = Создать сообщение с примером плагина
commands-makecontestpost-post-failed = Не удалось создать сообщение с публикацией
commands-makepluginpost-post-created = Публикация успешно создана: [{ $title }]({ $url })
commands-makepluginpost-format-post-message = 
    # :mailbox_with_mail: Как опубликовать свой плагин

    Для участия в конкурсе необходимо опубликовать ваш плагин в этом канале, соблюдая указанный ниже формат. Это упростит работу жюри и других участников при оценке ваших работ.

    ## :pencil: Формат публикации

    Публикация должна включать:

    1. **Название плагина**  
    Название вашего плагина.  

    2. **Описание**  
    Краткое описание, в котором вы расскажете, что делает ваш плагин, его особенности или идею.  

    3. **Скриншоты** *(если возможно)*  
    Прикрепите 1–3 изображения, показывающих работу вашего плагина.  

    4. **Файл или ссылка на исходный код**  
    Добавьте файл с исходным кодом плагина (например, `.zip`) или предоставьте ссылку на репозиторий (например, GitHub).
commands-makepluginpost-plugin-post-message = 
    ## :book: Пример публикации:

    \**Название:\**  
    WelcomePlugin

    \**Описание:\**  
    Плагин добавляет приветственное сообщение на экран при входе игрока на сервер

    \**Скриншоты:\**  
    \*(Приложите скриншоты, показывающие работу плагина)\*  

    \**Файл:\**  
    \*(Прикрепите .zip файл с исходным кодом или ссылку на репозиторий)\*